app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels" ORDER BY name ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "channels"
---
  def index
  	@channels = Channel.order('name ASC').page(params[:page]).per(10)