app/controllers/home_controller.rb

	def channel
		@channel_pub = Channel.where("location_id =?", params[:id])
		@loc_name = Location.find(params[:id])
---
SELECT `channels`.* FROM `channels` WHERE (location_id ='6')
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 6 LIMIT 1