app/controllers/locations_controller.rb

  def index
  	@locations = Location.order("name")
---
SELECT `locations`.* FROM `locations` ORDER BY name