app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users` WHERE (id != 1)
SELECT `users`.* FROM `users` WHERE (id != 1) ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
  	@users = User.where("id != ?", current_user.id).order("id DESC").page(params[:page]).per(10)